Artillery/test1.yml
config:
  target: "http://localhost:81"
  phases:
    - duration: 10
      arrivalCount: 10
      name: phase1
  payload:
    path: "users.csv"
    fields: 
      - "username"
    order: sequence
    skipHeader: true
scenarios:
  - flow: 
    - loop: 
        - think: 2
        - get:
            url: "/test1?ID={{ username }}"
      count: 20